snlkuharlocal/src/Catalogs/ФР_ПакетыДанных/ФР_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФР_ПакетыДанных</name>
  <attributes>
    <name>ДанныеПакета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиПакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Пакета</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Сеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <comment>Загрузка-Выгрузка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектовВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибокЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПакет</name>
    <type>
      <types>CatalogRef.ФР_ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПорядка</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиПакета</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыПакета</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ОперВыгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ФР_ПакетыДанных/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи",Истина);
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;		
		
	ЕстьОшибкиПакета = Ложь;	
		
	Если Модифицированность() Тогда		
		Если НЕ ЗначениеЗаполнено(ВерсияДанных) Тогда
			Если НЕ ЗначениеЗаполнено(ИД_Пакета) Тогда
				ИД_Пакета=Новый УникальныйИдентификатор();				
			КонецЕсли;
			УстановитьСсылкуНового(Справочники.ФР_ПакетыДанных.ПолучитьСсылку(ИД_Пакета));
		КонецЕсли;
		
		КоличествоОшибокЗагрузки = ОшибкиПакета.Количество();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)		
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	мПрефикс = "";
	Если ЗначениеЗаполнено(ПланОбмена) Тогда
		МетаОбъект = Метаданные.ПланыОбмена.Найти(ПланОбмена);
		Если МетаОбъект <> Неопределено Тогда
			мПрефикс = ОбщегоНазначения_ПИ.ЭтотУзелКод(ПланОбмена);
		Иначе                                          
			ТекстОшибки = СтрШаблон("Не найден план обмена: '%1' при записи пакета данных.", ПланОбмена);
			ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе   
		ТекстОшибки = СтрШаблон("Не найден план обмена: '%1' при записи пакета данных.", ПланОбмена);
		ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");	
		
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Префикс = ?(ПустаяСтрока(мПрефикс), "ZZZ", мПрефикс) + "-";	
КонецПроцедуры //ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
